# RailingCanBeHostedByElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..RailingCanBeHostedByElement Method
Railing Class See Also
---
Checks whether the specified element can be used as a host for the railing. The host can be:
  * stairs
  * stairs component
  * ramp
  * floor
  * slab edge
  * wall
  * roof

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool RailingCanBeHostedByElement(
	ElementId hostId
)
```

Visual Basic
---
```text
Public Function RailingCanBeHostedByElement ( _
	hostId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool RailingCanBeHostedByElement(
	ElementId^ hostId
)
```

# ### Parameters
hostId
    Type: Autodesk.Revit.DB..::..ElementId Element id to check.
# ### Return Value
True if the element can be used as host for the railing.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace